In [1]:
import pandas as pd
diamonds = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/diamonds.csv')
l = [1, 3, 5, 7, 9, 11]
print("Original list:")
print(l)
print("Convert the list to a Series:")
result = pd.Series(l)
print(result)

Original list:
[1, 3, 5, 7, 9, 11]
Convert the list to a Series:
0     1
1     3
2     5
3     7
4     9
5    11
dtype: int64

In [2]:
date_series = pd.date_range(start = '05-01-2021', end = '05-12-2021')

print(date_series)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [3]:
dictionary = {'name': ['Vinay', 'Kushal', 'Aman'],
              'age' : [22, 25, 24],
              'occ' : ['engineer', 'doctor', 'accountant']}

dataframe = pd.DataFrame(dictionary)

print(dataframe)

     name  age         occ
0   Vinay   22    engineer
1  Kushal   25      doctor
2    Aman   24  accountant

In [4]:
lists = [[2, 'Vishal', 22],
         [1, 'Kushal', 25],
         [1, 'Aman', 24]]

dataframe = pd.DataFrame(lists, columns = ['id', 'name', 'age'])

print(dataframe)

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

In [8]:
dataframe = pd.read_csv('data.csv')

print(dataframe)

     id    name  age         occ
0     1   Vinay   22    engineer
1     2  Kushal   25      doctor
2     3    Aman   24  accountant

In [56]:
import pandas as pd
data = {'eid': [1, 2, 3, 4, 5],
        'ename': ['Alice', 'Bob', 'Cathy', 'David', 'Eva'],
        'stipend': [1000, 2000, 3000, 4000, 5000]}
index = ['x', 'y', 'z', 'a', 'b']
df = pd.DataFrame(data, index=index)
print("Original DataFrame with Custom Indexing:")
print(df)
df = df.reset_index(drop=True)

print("\nDataFrame with Default Indexing:")
print(df)

Original DataFrame with Custom Indexing:
   eid  ename  stipend
x    1  Alice     1000
y    2    Bob     2000
z    3  Cathy     3000
a    4  David     4000
b    5    Eva     5000

DataFrame with Default Indexing:
   eid  ename  stipend
0    1  Alice     1000
1    2    Bob     2000
2    3  Cathy     3000
3    4  David     4000
4    5    Eva     5000

In [28]:
print(dataframe)

print()

dataframe1 = dataframe.reset_index()

print(dataframe1)

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

   index  id    name  age
0      0   2  Vishal   22
1      1   1  Kushal   25
2      2   1    Aman   24

In [29]:
print(dataframe)

print()

o = dataframe.iloc[[0,1], :]

print(o)

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

   id    name  age
0   2  Vishal   22
1   1  Kushal   25

In [32]:
lists = [ 'Vinay', 'engineer',50000],['Kushal' ,'engineer',30000] ,[ 'Aman', 'accountant',20000]
dataframe = pd.DataFrame(lists, columns = [ 'name', 'occ','salary'])
print(dataframe) 

print()

occ_average_age = dataframe.groupby('occ')['salary'].mean()

print(occ_average_age)

     name         occ  salary
0   Vinay    engineer   50000
1  Kushal    engineer   30000
2    Aman  accountant   20000

occ
accountant    20000.0
engineer      40000.0
Name: salary, dtype: float64

In [44]:
import pandas as pd
import numpy as np
 
nums = {'Set_of_Numbers': [2, 3, 5, 7, 11, 13, 
                           np.nan, 19, 23, np.nan]}
print(nums)

df = pd.DataFrame(nums, columns =['Set_of_Numbers'])
 
df['Set_of_Numbers'] = df['Set_of_Numbers'].fillna(0)
 
df

{'Set_of_Numbers': [2, 3, 5, 7, 11, 13, nan, 19, 23, nan]}

   Set_of_Numbers
0             2.0
1             3.0
2             5.0
3             7.0
4            11.0
5            13.0
6             0.0
7            19.0
8            23.0
9             0.0

In [54]:
import pandas as pd
data = {'cname': ['A', 'B', 'C', 'D', 'E'],
        'profit': [100, -200, 300, 0, -400]}
df = pd.DataFrame(data)
df['profit'] = df['profit'].apply(lambda x: True if x > 0 else False)

print(df)

  cname  profit
0     A    True
1     B   False
2     C    True
3     D   False
4     E   False

In [55]:
df1 = pd.DataFrame({
    'eid': [1, 2, 3, 4, 5],
    'ename': ['Alice', 'Bob', 'Cathy', 'David', 'Eva'],
    'stipend': [1000, 2000, 3000, 4000, 5000]
})

df2 = pd.DataFrame({
    'eid': [1, 2, 3, 4, 5],
    'designation': ['CEO', 'COO', 'CTO', 'CFO', 'CIO']
})

df = pd.merge(df1, df2, on='eid')

print(df)

   eid  ename  stipend designation
0    1  Alice     1000         CEO
1    2    Bob     2000         COO
2    3  Cathy     3000         CTO
3    4  David     4000         CFO
4    5    Eva     5000         CIO